uhnp/src/Catalogs/ПротоколируемыеСобытия/ПротоколируемыеСобытия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПротоколируемыеСобытия</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>DocumentRef.Трансляция</types>
      <types>DocumentRef.ТрансформационнаяКорректировка</types>
      <types>CatalogRef.ХранимыеФайлыОрганизацийПрисоединенныеФайлы</types>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФайлИмпорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлИмпорта</name>
    <type>
      <types>CatalogRef.ХранимыеФайлыОрганизацийПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Реструктуризация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеРеструктуризации</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Записи</name>
    <attributes>
      <name>Событие</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сообщение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаписи</name>
      <type>
        <types>EnumRef.ТипыЗаписейПротоколируемыхСобытий</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектДанных</name>
      <type>
        <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
        <types>CatalogRef.ХранимыеФайлыОрганизацийПрисоединенныеФайлы</types>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>280</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТехническаяИнформацияСтрокаВнутр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяMs</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтекстСобытия</name>
      <type>
        <types>EnumRef.КонтекстПротоколируемогоСобытия</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательОтчета</name>
      <type>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Обработано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодОтчета</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Enums/СпособыИспользованияОперандов/СпособыИспользованияОперандов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыИспользованияОперандов</name>
  <enumValues>
    <name>ДляФормулРасчета</name>
  </enumValues>
  <enumValues>
    <name>ДляПримечаний</name>
  </enumValues>
  <enumValues>
    <name>ДляОбратногоРаспределения</name>
  </enumValues>
  <enumValues>
    <name>ДляКонтрольныхСоотношений</name>
  </enumValues>
  <enumValues>
    <name>ДляРучныхКорректировок</name>
  </enumValues>
  <enumValues>
    <name>ДляПараметрическихУсловий</name>
  </enumValues>
  <enumValues>
    <name>ДляАналитическихОтчетов</name>
  </enumValues>
  <enumValues>
    <name>ДляТрансформационныхКорректировок</name>
  </enumValues>
  <enumValues>
    <name>ДляЗаполненияОбъектовБД</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныеДанные</name>
  </enumValues>
  <enumValues>
    <name>ДляСверкиВГО</name>
  </enumValues>
  <enumValues>
    <name>ДляОбменаДанными</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ПротоколируемыеСобытия/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФайлИмпорта.Видимость=ЗначениеЗаполнено(Объект.ФайлИмпорта);
	
	Элементы.ДекорацияЕстьОшибки.Видимость=Объект.ЕстьОшибки;
	
	Элементы.Обработано.Видимость=(Объект.ЕстьОшибки ИЛИ Объект.Реструктуризация);
	Элементы.ЗаписиОтработано.Видимость=Элементы.Обработано.Видимость;
	Элементы.ЗаписиПоказательОтчета.Видимость=Объект.Реструктуризация;
	
	Если Объект.Реструктуризация Тогда
		
		Элементы.ЗаписиОбъектДанных.Заголовок=Нстр("ru = 'Правило обработки'");
		
	КонецЕсли;
	
	ДанныеРеструктуризации=РеквизитФормыВЗначение("Объект").ДанныеРеструктуризации.Получить();
	
	Если ТипЗнч(ДанныеРеструктуризации)=Тип("Структура") Тогда
		
		ОбщегоНазначенияКлиентСерверУХ.ПоместитьТаблицуЗначенийВКоллекциюФормы(ДанныеРеструктуризации.ТаблицаАналитикСтар,ТаблицаАналитикСтар);
		ОбщегоНазначенияКлиентСерверУХ.ПоместитьТаблицуЗначенийВКоллекциюФормы(ДанныеРеструктуризации.ТаблицаАналитикНов,ТаблицаАналитикНов);
		
		Элементы.ГруппаРеструктуризация.Видимость=Истина;
		
	Иначе
		
		Элементы.ГруппаРеструктуризация.Видимость=Ложь;
		
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаписиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Объект.Реструктуризация И ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ИсточникДанныхДляРасчетов", Элементы.Записи.ТекущиеДанные.ОбъектДанных);
		СтруктураПараметров.Вставить("ПотребительРасчета", Элементы.Записи.ТекущиеДанные.ПоказательОтчета);
		СтруктураПараметров.Вставить("СпособИспользования", ПредопределенноеЗначение("Перечисление.СпособыИспользованияОперандов.ДляФормулРасчета"));
		Имя = "ОбщаяФорма.ФормаНастройкиФормулРасчета";
		ОткрытьФорму(Имя, СтруктураПараметров, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработаноПриИзменении(Элемент)
	
	Если Объект.Обработано Тогда
		
		Для Каждого Строка ИЗ Объект.Записи Цикл
			
			Строка.Обработано=Истина;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписиОтработаноПриИзменении(Элемент)
	
	Объект.Обработано=Объект.Записи.НайтиСтроки(Новый Структура("Обработано",Ложь)).Количество()=0;
	
КонецПроцедуры
